## Plan for org_account/guardrails_alerting
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                           |
|--------|----------------------------------------------------------|
| add    | `aws_cloudwatch_event_rule.cloud_brokering_monitoring`   |
|        | `aws_cloudwatch_event_target.cloud_brokering_sns_target` |
|        | `aws_sns_topic.cloud_brokering_alerts`                   |
|        | `aws_sns_topic_policy.cloud_brokering_alerts`            |
|        | `aws_sns_topic_subscription.sre_team_email`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cloud_brokering_monitoring will be created
  + resource "aws_cloudwatch_event_rule" "cloud_brokering_monitoring" {
      + arn            = (known after apply)
      + description    = "Monitor IAM actions performed by Cloud Brokering role"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName    = [
                      + "DeleteRolePolicy",
                      + "AttachRolePolicy",
                      + "DeleteRole",
                      + "DetachRolePolicy",
                      + "PutRolePolicy",
                      + "UpdateAssumeRolePolicy",
                    ]
                  + eventSource  = [
                      + "iam.amazonaws.com",
                    ]
                  + userIdentity = {
                      + sessionContext = {
                          + sessionIssuer = {
                              + arn  = "arn:aws:iam::659087519042:role/SSC-CloudBrokering"
                              + type = [
                                  + "Role",
                                ]
                            }
                        }
                    }
                }
              + detail-type = [
                  + "AWS API Call via CloudTrail",
                ]
              + source      = [
                  + "aws.iam",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "cloud-brokering-iam-monitoring"
      + name_prefix    = (known after apply)
      + state          = "ENABLED"
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.cloud_brokering_sns_target will be created
  + resource "aws_cloudwatch_event_target" "cloud_brokering_sns_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "cloud-brokering-iam-monitoring"
      + target_id      = "CloudBrokeringSNSTarget"

      + input_transformer {
          + input_paths    = {
              + "awsRegion"        = "$.detail.awsRegion"
              + "eventId"          = "$.detail.eventId"
              + "eventName"        = "$.detail.eventName"
              + "eventTime"        = "$.detail.eventTime"
              + "sessionIssuerArn" = "$.detail.userIdentity.sessionContext.sessionIssuer.arn"
              + "sourceIPAddress"  = "$.detail.sourceIPAddress"
              + "userArn"          = "$.detail.userIdentity.arn"
            }
          + input_template = jsonencode(
                {
                  + action_required = "Investigate this activity immediately to ensure it was authorized"
                  + alert_type      = "CLOUD_BROKERING_SECURITY_EVENT"
                  + event_id        = "<eventId>"
                  + event_name      = "<eventName>"
                  + event_time      = "<eventTime>"
                  + message         = "🚨 SECURITY ALERT: Cloud Brokering role performed IAM action '<eventName>' at <eventTime> from IP <sourceIPAddress>"
                  + region          = "<awsRegion>"
                  + role_arn        = "<sessionIssuerArn>"
                  + severity        = "HIGH"
                  + source_ip       = "<sourceIPAddress>"
                  + user_arn        = "<userArn>"
                }
            )
        }
    }

  # aws_sns_topic.cloud_brokering_alerts will be created
  + resource "aws_sns_topic" "cloud_brokering_alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + delivery_policy             = jsonencode(
            {
              + http = {
                  + defaultHealthyRetryPolicy    = {
                      + backoffFunction    = "linear"
                      + maxDelayTarget     = 20
                      + minDelayTarget     = 20
                      + numMaxDelayRetries = 0
                      + numMinDelayRetries = 0
                      + numNoDelayRetries  = 0
                      + numRetries         = 3
                    }
                  + disableSubscriptionOverrides = false
                }
            }
        )
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "alias/aws/sns"
      + name                        = "cloud-brokering-security-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_policy.cloud_brokering_alerts will be created
  + resource "aws_sns_topic_policy" "cloud_brokering_alerts" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # aws_sns_topic_subscription.sre_team_email will be created
  + resource "aws_sns_topic_subscription" "sre_team_email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + delivery_policy                 = jsonencode(
            {
              + healthyRetryPolicy = {
                  + backoffFunction    = "linear"
                  + maxDelayTarget     = 20
                  + minDelayTarget     = 20
                  + numMaxDelayRetries = 0
                  + numMinDelayRetries = 0
                  + numNoDelayRetries  = 0
                  + numRetries         = 3
                }
            }
        )
      + endpoint                        = "sre-ifs@cds-snc.ca"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + email_subscription_arn = (known after apply)
  + eventbridge_rule_arn   = (known after apply)
  + eventbridge_rule_name  = "cloud-brokering-iam-monitoring"
  + sns_topic_arn          = (known after apply)
  + sns_topic_name         = "cloud-brokering-security-alerts"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cloud_brokering_monitoring"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloud_brokering_alerts"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
